fn main() {
  // ------------------------------- 不変変数 -------------------------------
    // let x = 5;
    // println!("x is {x}");
    // // x = 6; // 不変変数xに2回代入できないのでエラー

  // ------------------------------- 可変変数 -------------------------------
    // let mut x = 5; // mutは可変変数を宣言するためのキーワード
    // println!("x is {x}");
    // x = 6; // 可変変数なので2回目も代入できる
    // println!("x is {x}");

  // ------------------------------- 定数 -------------------------------
  // 定数にはmutを使えない: 定数は標準で不変であるだけでなく常に不変
    const MAX_POINTS: u32 = 100_000;
    println!("MAX_POINTS is {MAX_POINTS}");
}